-- 덤프데이터
-- Member
-- 100 ~ 149번까지는 남자, 150 ~ 199번까지는 여자로 계획중
-- 100번 계정이 테스트 계정으로 사용될 예정!!
INSERT INTO member_sometimes VALUES(100, now(), now(), '이경택', 'playground', '삼성화재유성연수원 종합운동장', 36.355416671993, 127.300746447852, 3), (101, now(), now(), '홍치원', '스테판커리', '갈마공원', 36.3561823752851, 127.37279449758137, 10), (102, now(), now(), '김웅', '축구왕', '갈마공원', 36.3561823752851, 127.37279449758137, 10), (103, now(), now(), '탁현승', '농구왕', '월평공원', 36.34566825296461, 127.35719336827191, 3), (104, now(), now(), '류경구', '마이클조던', '갈마공원', 36.3561823752851, 127.37279449758137, 7), (105, now(), now(), '정재범', '해리케인', '고운뜰공원', 36.3663369, 127.2961423, 5), (106, now(), now(), '문남규', '분데스리가', '고운뜰공원', 36.3663369, 127.2961423, 5), (107, now(), now(), '한치원', '신의손', '월평공원', 36.34566825296461, 127.35719336827191, 3), (108, now(), now(), '황동건', '버저비터', '월평공원', 36.34566825296461, 127.35719336827191, 2), (109, now(), now(), '하치원', '농구초보', '은평공원', 36.3588240919261, 127.364789627744, 7);
INSERT INTO member_sometimes VALUES(110, now(), now(), '류광조', '농구고수', '은평공원', 36.3588240919261, 127.364789627744, 7), (111, now(), now(), '성철', '덩크왕', '유림공원', 36.3599257881606, 127.358082996041, 4), (112, now(), now(), '정병헌', '논현동메시', '유림공원', 36.3599257881606, 127.358082996041, 4), (113, now(), now(), '정승헌', '논현동외질', '유림공원', 36.3599257881606, 127.358082996041, 4), (114, now(), now(), '윤재섭', '레이업장인', '샘머리공원', 36.3567909089522, 127.384379861868, 6), (115, now(), now(), '김유준', 'only센터', '샘머리공원', 36.3567909089522, 127.384379861868, 6), (116, now(), now(), '김재윤', '우리흥민', '샘머리공원', 36.3567909089522, 127.384379861868, 6), (117, now(), now(), '한용태', '포인트가드', '보라매공원', 36.3485922696972, 127.383742449286, 6), (118, now(), now(), '김규혁', '슈팅가드', '보라매공원', 36.3485922696972, 127.383742449286, 6), (119, now(), now(), '이용수', '스몰포워드', '보라매공원', 36.3485922696972, 127.383742449286, 6);
INSERT INTO member_sometimes VALUES(120, now(), now(), '이태욱', '스매시장인', '시간공원', 36.3575568232489, 127.304361710537, 3);
INSERT INTO member_sometimes VALUES(150, now(), now(), '박민서', '민서짱', '시간공원', 36.3575568232489, 127.304361710537, 5), (151, now(), now(), '이지혜', '카리나', '시간공원', 36.3575568232489, 127.304361710537, 5), (152, now(), now(), '김유리', '유리구두', '우송대학교 운동장2', 36.3387022483686, 127.446905359731, 3), (153, now(), now(), '윤여진', '여진공주', '충남대학교 남부운동장', 36.3645715314101, 127.344532295571, 7);

INSERT INTO member_often VALUES(100, now(), now(), 'playground와 함께 운동을 즐겨보세요!', '9-22', '웹토큰', '모바일토큰', ''), (101, now(), now(), '주중 오후 8시~10시 농구하실분 연락주세요!', '20-22', '웹토큰', '모바일토큰', ''), (102, now(), now(), '갈마공원에서 축구 자주합니다~', '18-20', '웹토큰', '모바일토큰', ''), (103, now(), now(), '월평공원 농구ㄱㄱ', '10-11', '웹토큰', '모바일토큰', ''), (104, now(), now(), '마이클조던이 되고 싶어요', '14-17', '웹토큰', '모바일토큰', ''), (105, now(), now(), '축구 할사람 연락 주세요! 고운뜰공원에서 자주 합니다.', '19-23', '웹토큰', '모바일토큰', ''), (106, now(), now(), '고운뜰공원 축구고고~~ 18시 이후만', '18-24', '웹토큰', '모바일토큰', ''), (107, now(), now(), '제가 바로 신의손입니다.', '19-22', '웹토큰', '모바일토큰', ''), (108, now(), now(), '버저비터의 짜릿함', '6-8', '웹토큰', '모바일토큰', ''), (109, now(), now(), '농구 입문한지 1달 됬습니다. 살살부탁드려요', '15-17', '웹토큰', '모바일토큰', '');
INSERT INTO member_often VALUES(110, now(), now(), 'playground와 함께 운동을 즐겨보세요!', '9-22', '웹토큰', '모바일토큰', ''), (111, now(), now(), '주중 오후 8시~10시 농구하실분 연락주세요!', '20-22', '웹토큰', '모바일토큰', ''), (112, now(), now(), '갈마공원에서 축구 자주합니다~', '18-20', '웹토큰', '모바일토큰', ''), (113, now(), now(), '월평공원 농구ㄱㄱ', '10-11', '웹토큰', '모바일토큰', ''), (114, now(), now(), '마이클조던이 되고 싶어요', '14-17', '웹토큰', '모바일토큰', ''), (115, now(), now(), '축구 할사람 연락 주세요! 고운뜰공원에서 자주 합니다.', '19-23', '웹토큰', '모바일토큰', ''), (116, now(), now(), '고운뜰공원 축구고고~~ 18시 이후만', '18-24', '웹토큰', '모바일토큰', ''), (117, now(), now(), '제가 바로 신의손입니다.', '19-21', '웹토큰', '모바일토큰', ''), (118, now(), now(), '버저비터의 짜릿함', '6-8', '웹토큰', '모바일토큰', ''), (119, now(), now(), '농구 입문한지 1달 됬습니다. 살살부탁드려요', '15-17', '웹토큰', '모바일토큰', '');
INSERT INTO member_often VALUES(120, now(), now(), '나보다 스매시 잘치는 사람은 없을걸?', '18-22', '웹토큰', '모바일토큰', '');
INSERT INTO member_often VALUES(150, now(), now(), '시간공원에서 배드민턴 해요~~', '20-22', '웹토큰', '모바일토큰', ''), (151, now(), now(), '축구 너무 재미있어요!', '19-21', '웹토큰', '모바일토큰', ''), (152, now(), now(), '우송대학교 운동장에서 같이 농구해요!!', '13-15', '웹토큰', '모바일토큰', ''), (153, now(), now(), '충남대 근처 배드민턴 할사람~~', '10-11', '웹토큰', '모바일토큰', '');

INSERT INTO prefer_activities VALUES('축구', 100, now(), now(), '중수', 1), ('농구', 100, now(), now(), '고수', 1), ('배드민턴', 100, now(), now(), '입문', 0), ('축구', 101, now(), now(), '초수', 1), ('농구', 101, now(), now(), '중수', 1), ('배드민턴', 101, now(), now(), '중수', 1), ('축구', 102, now(), now(), '고수', 1), ('농구', 102, now(), now(), '입문', 0), ('배드민턴', 102, now(), now(), '입문', 0), ('축구', 103, now(), now(), '초수', 0), ('농구', 103, now(), now(), '고수', 1), ('배드민턴', 103, now(), now(), '초수', 1), ('축구', 104, now(), now(), '초수', 0), ('농구', 104, now(), now(), '중수', 1), ('배드민턴', 104, now(), now(), '입문', 0), ('축구', 105, now(), now(), '고수', 1), ('농구', 105, now(), now(), '중수', 1), ('배드민턴', 105, now(), now(), '중수', 1), ('축구', 106, now(), now(), '중수', 1), ('농구', 106, now(), now(), '초수', 0), ('배드민턴', 106, now(), now(), '입문', 0), ('축구', 107, now(), now(), '중수', 1), ('농구', 107, now(), now(), '중수', 1), ('배드민턴', 107, now(), now(), '입문', 0), ('축구', 108, now(), now(), '초수', 1), ('농구', 108, now(), now(), '중수', 1), ('배드민턴', 108, now(), now(), '중수', 1), ('축구', 109, now(), now(), '중수', 1), ('농구', 109, now(), now(), '초수', 1), ('배드민턴', 109, now(), now(), '입문', 1);
INSERT INTO prefer_activities VALUES('축구', 110, now(), now(), '중수', 1), ('농구', 110, now(), now(), '고수', 1), ('배드민턴', 110, now(), now(), '입문', 0), ('축구', 111, now(), now(), '초수', 1), ('농구', 111, now(), now(), '중수', 1), ('배드민턴', 111, now(), now(), '중수', 1), ('축구', 112, now(), now(), '고수', 1), ('농구', 112, now(), now(), '입문', 0), ('배드민턴', 112, now(), now(), '입문', 0), ('축구', 113, now(), now(), '초수', 0), ('농구', 113, now(), now(), '고수', 1), ('배드민턴', 113, now(), now(), '초수', 1), ('축구', 114, now(), now(), '초수', 0), ('농구', 114, now(), now(), '중수', 1), ('배드민턴', 114, now(), now(), '입문', 0), ('축구', 115, now(), now(), '고수', 1), ('농구', 115, now(), now(), '중수', 1), ('배드민턴', 115, now(), now(), '중수', 1), ('축구', 116, now(), now(), '중수', 1), ('농구', 116, now(), now(), '초수', 0), ('배드민턴', 116, now(), now(), '입문', 0), ('축구', 117, now(), now(), '중수', 1), ('농구', 117, now(), now(), '고수', 1), ('배드민턴', 117, now(), now(), '입문', 0), ('축구', 118, now(), now(), '초수', 1), ('농구', 118, now(), now(), '중수', 1), ('배드민턴', 118, now(), now(), '중수', 1), ('축구', 119, now(), now(), '중수', 1), ('농구', 119, now(), now(), '초수', 1), ('배드민턴', 119, now(), now(), '입문', 1);
INSERT INTO prefer_activities VALUES('축구', 120, now(), now(), '초수', 0), ('농구', 120, now(), now(), '초수', 0), ('배드민턴', 120, now(), now(), '고수', 1);
INSERT INTO prefer_activities VALUES('축구', 150, now(), now(), '초수', 1), ('농구', 150, now(), now(), '입문', 0), ('배드민턴', 150, now(), now(), '입문', 1), ('축구', 151, now(), now(), '중수', 1), ('농구', 151, now(), now(), '초수', 0), ('배드민턴', 151, now(), now(), '초수', 1), ('축구', 152, now(), now(), '입문', 0), ('농구', 152, now(), now(), '중수', 1), ('배드민턴', 152, now(), now(), '초수', 1), ('축구', 153, now(), now(), '초수', 1), ('농구', 153, now(), now(), '입문', 0), ('배드민턴', 153, now(), now(), '입문', 1);


-- Place
INSERT INTO place VALUES(1, '고운뜰공원', 36.3663369, 127.2961423), (2, '갈마공원', 36.3561823752851, 127.37279449758137), (3, '월평공원', 36.34566825296461, 127.35719336827191), (4, '은평공원', 36.3588240919261, 127.364789627744), (5, '유림공원', 36.3599257881606, 127.358082996041), (6, '샘머리공원', 36.3567909089522, 127.384379861868), (7, '보라매공원', 36.3485922696972, 127.383742449286), (8, '시간공원', 36.3575568232489, 127.304361710537), (9, '삼성화재유성연수원 종합운동장', 36.355416671993, 127.300746447852), (10, '우송대학교 운동장2', 36.3387022483686, 127.446905359731), (11, '충남대학교 남부운동장', 36.3645715314101, 127.344532295571), (12, '남선공원', 36.3449249815957, 127.399135496298), (13, '서대전공원', 36.3215422855689, 127.41158347913), (14, '사정공원', 36.2982674525956, 127.408182522527), (15, '안영 축구장', 36.2871404929589, 127.372879916227), (16, '엑스포공원', 36.3984099056032, 127.405698617538), (17, '상옥 체육공원', 36.3887900717777, 127.406322952648), (18, '우송대학교 운동장1', 36.3363733666878, 127.452717402243), (19, '한밭 수목원', 36.3690499151502, 127.388034891859), (20, '연구단지 종합 운동장', 36.3843552475792, 127.356567217282), (21, '을미기 체육공원', 36.4421985879037, 127.410636001597), (22, '옥녀봉 체육공원', 36.3311975422136, 127.345719023471), (23, '송촌고등학교 운동장', 36.3630507320089, 127.446623928442), (24, '길치문화공원', 36.3587794764493, 127.458442959497);


-- Live(live_id, place_id, detail, 현재 인원, 전체 인원, 등록 시간, 호스트id(등록한 사람의 id), 운동 종목) // live_member(live_member_id(auto increment), live_id, member_id)
-- 라이브 매칭은 시연하기 직전에 넣을 예정!!!!
INSERT INTO live VALUES(1, 2, '갈마공원 3대3 농구 2명 구해요~~', 4, 6, '2023-02-19 23:30:00', 101, '농구'), (2, 3, '축구 할사람!', 1, 6, '2023-02-19 23:30:00', 112, '축구'), (3, 3, '배드민턴 한시간 ㄱㄱ~', 5, 6, '2023-02-19 23:28:00', 120, '배드민턴'), (4, 4, '농구 드루와', 2, 6, '2023-02-19 23:10:00', 103, '농구'), (5, 9, '싸피 농구대회ㄱㄱ', 1, 6, '2023-02-19 23:20:00', 117, '농구'), (6, 4, '은평공원 농구 1명만 빨리!!', 5, 6, '2023-02-20 23:12:00', 109, '농구');
INSERT INTO live_member VALUES(1, 1, 101), (2, 2, 112), (3, 3, 120), (4, 4, 103), (5, 5, 117), (6, 6, 109);


-- gathering(*gathering_id(오토 increament), *place_id, *title(제목), description(내용), *people(인원), *start_date, *start_time, *play_time(경기 시간), *is_completed(진행된 경기인지 아닌지), *host_id(gathering 주최자), *sex(성별), *level(운동 수준), *sports(운동 종목)) // gathering_member(gathering_member_id(오토 인크리먼트), gathering_id, member_id)
INSERT INTO gathering VALUES(1, 1, '3대3 농구하실분~', '같이 농구해요', 6, '2023-02-20', '18:00', 2, 0, 101, '남성', '중수', '농구', '3vs3'), (2, 3, '저녁엔 농구', '월평공원에서 같이 농구해요', 10, '2023-02-20', '18:30', 2, 0, 102, '남성', '고수', '농구', '5vs5'), (3, 9, '퇴근전 농구', '퇴근하기 전에 농구 한판?', 6, '2023-02-21', '18:30', 1, 0, 103, '남성', '초수', '농구', '3vs3'), (4, 5, '점심 농구팟', '점심 먹고 농구할 사람~~', 10, '2023-02-18', '13:30', 2, 0, 114, '남성', '초수', '농구', '3vs3'), (5, 5, '점심 농구팟', '점심 먹고 농구할 사람~~', 10, '2023-02-20', '13:30', 2, 0, 114, '남성', '초수', '농구', '3vs3'), (6, 5, '점심 농구팟', '점심 먹고 농구할 사람~~', 10, '2023-02-20', '13:30', 2, 0, 114, '남성', '초수', '농구', '3vs3'), (7, 3, '월평 농구 모임', '같이 농구해요', 6, '2023-02-17', '17:30', 2, 0, 111, '남성', '중수', '농구', '5vs5'), (8, 6, '샘머리 농구 고수만', '풀코트 뛰실 고수분들 오세요!!', 10, '2023-02-20', '14:00', 2, 0, 117, '남성', '고수', '농구', '5vs5');
INSERT INTO gathering VALUES(9, 8, '5대5 풋살 오세요~', '같이 풋살해요', 10, '2023-02-17', '18:30', 2, 0, 102, '남성', '중수', '축구', '5vs5'), (10, 15, '11대11 축구 용병 한 분!', '한 분만 오시면 됩니다. 언제든지 신청해주세요!', 22, '2023-02-22', '14:30', 2, 0, 112, '남성', '중수', '축구', '11vs11'), (11, 8, '여자 초보 축구 5대5', '초보 여자분들만 신청해주세요!!', 10, '2023-02-20', '19:00', 2, 0, 150, '여성', '초수', '축구', '5vs5');
INSERT INTO gathering VALUES(12, 17, '배드민턴 쳐요~', '같이 배드민턴 쳐요', 2, '2023-02-20', '10:30', 1, 0, 120, '남성', '중수', '배드민턴', '1vs1'), (13, 13, '배드민턴 한판!', '서대전 공원 좋아요', 2, '2023-02-19', '10:30', 1, 0, 108, '남성', '초수', '배드민턴', '1vs1');
INSERT INTO gathering_member VALUES(1, 1, 101), (2, 2, 102), (3, 3, 103), (4, 4, 114), (5, 5, 114), (6, 6, 114), (7, 7, 111), (8, 8, 117), (9, 9, 102), (10, 10, 112), (11, 11, 150), (12, 12, 120);
INSERT INTO gathering_member VALUES(13, 1, 118), (14, 1, 114), (15, 2, 104), (16, 3, 105), (17, 9, 113), (18, 9, 119), (19, 9, 111), (20, 9, 107), (21, 9, 108);
INSERT INTO gathering_member VALUES(26, 1, 104), (27, 1, 105), (28, 3, 112), (29, 3, 116), (30, 3, 119);
-- 테스트 계정용
INSERT INTO gathering VALUES(14, 9, '3대3 농구하실분~', '같이 농구해요', 6, '2023-02-20', '13:00', 2, 0, 101, '남성', '중수', '농구', '3vs3');
INSERT INTO gathering_member VALUES(23, 4, 100), (24, 9, 100), (25, 13, 100);

-- INSERT INTO gathering VALUES(9, 3, '금요일엔 축구', '한주의 마무리로 축구 어떠신가요?', 10, '2023-02-17', '19:00', 2, 0, 111, '남성', '중수', '축구', '5vs5');


-- team
INSERT INTO team VALUES(1, '슬램덩크', '농구', '5vs5', '고수', 1800), (3, 'MUNKS', '농구', '5vs5', '초수', 1200), (4, '스트릿바스켓', '농구', '3vs3', '초수', 1200);
INSERT INTO team_member VALUES(1, 1, 111), (2, 1, 100), (3, 1, 101), (4, 1, 102), (5, 1, 103), (11, 3, 109), (12, 3, 110), (13, 3, 111), (14, 3, 112), (15, 4, 113), (16, 4, 114), (17, 4, 115);

INSERT INTO team VALUES(2, '양천구 맨시티', '축구', '5vs5', '중수', 1500), (5, '유성구슛돌이', '축구', '5vs5', '입문', 900);
INSERT INTO team_member VALUES(6, 2, 104), (7, 2, 105), (8, 2, 106), (9, 2, 107), (10, 2, 108), (18, 5, 116), (19, 5, 117), (20, 5, 118), (21, 5, 119);

INSERT INTO team VALUES(6, '셔틀콕', '배드민턴', '2vs2', '초수', 1200), (7, '잘하면이용대', '배드민턴', '2vs2', '초수', 1200);
INSERT INTO team_member VALUES(22, 6, 120), (23, 6, 100), (24, 7, 101), (25, 7, 102);

-- match
INSERT INTO preferred_place VALUES(1, '고운뜰공원', 36.3663369, 127.2961423), (2, '갈마공원', 36.3561823752851, 127.37279449758137), (3, '월평공원', 36.34566825296461, 127.35719336827191), (4, '은평공원', 36.3588240919261, 127.364789627744), (5, '유림공원', 36.3599257881606, 127.358082996041), (6, '샘머리공원', 36.3567909089522, 127.384379861868), (7, '보라매공원', 36.3485922696972, 127.383742449286), (8, '시간공원', 36.3575568232489, 127.304361710537), (9, '삼성화재유성연수원 종합운동장', 36.355416671993, 127.300746447852), (10, '우송대학교 운동장2', 36.3387022483686, 127.446905359731), (11, '충남대학교 남부운동장', 36.3645715314101, 127.344532295571), (12, '남선공원', 36.3449249815957, 127.399135496298), (13, '서대전공원', 36.3215422855689, 127.41158347913), (14, '사정공원', 36.2982674525956, 127.408182522527), (15, '안영 축구장', 36.2871404929589, 127.372879916227), (16, '엑스포공원', 36.3984099056032, 127.405698617538), (17, '상옥 체육공원', 36.3887900717777, 127.406322952648), (18, '우송대학교 운동장1', 36.3363733666878, 127.452717402243), (19, '한밭 수목원', 36.3690499151502, 127.388034891859), (20, '연구단지 종합 운동장', 36.3843552475792, 127.356567217282), (21, '을미기 체육공원', 36.4421985879037, 127.410636001597), (22, '옥녀봉 체육공원', 36.3311975422136, 127.345719023471), (23, '송촌고등학교 운동장', 36.3630507320089, 127.446623928442), (24, '길치문화공원', 36.3587794764493, 127.458442959497);
INSERT INTO `match` VALUES(1, 1, '2023-02-01', '17:00:00', '19:00:00', 1, 10, '농구', '5vs5', 1);
INSERT INTO team_match_result VALUES(1, 1, 1, '승'), (2, 3, 1, '패');
INSERT INTO `match` VALUES(2, 3, '2023-02-02', '15:00:00', '18:00:00', 2, 5, '농구', '5vs5', 1);
INSERT INTO team_match_result VALUES(3, 3, 2, '승'), (4, 1, 2, '패');
INSERT INTO `match` VALUES(3, 1, '2023-02-03', '15:00:00', '18:00:00', 3, 9, '농구', '5vs5', 1);
INSERT INTO team_match_result VALUES(5, 1, 3, '패'), (6, 3, 3, '승');
INSERT INTO `match` VALUES(4, 1, '2023-02-04', '15:00:00', '18:00:00', 1, 15, '농구', '5vs5', 1);
INSERT INTO team_match_result VALUES(7, 1, 4, '패'), (8, 4, 4, '승');
INSERT INTO `match` VALUES(5, 3, '2023-02-05', '15:00:00', '18:00:00', 2, 6, '농구', '5vs5', 1);
INSERT INTO team_match_result VALUES(9, 3, 5, '승'), (10, 4, 5, '패');
INSERT INTO `match` VALUES(6, 1, '2023-02-06', '15:00:00', '18:00:00', 3, 10, '농구', '5vs5', 1);
INSERT INTO team_match_result VALUES(11, 1, 6, '패'), (12, 4, 6, '승');
INSERT INTO `match` VALUES(7, 4, '2023-02-07', '15:00:00', '18:00:00', 2, 11, '농구', '5vs5', 1);
INSERT INTO team_match_result VALUES(13, 4, 7, '무'), (14, 3, 7,'무');
INSERT INTO `match` VALUES(8, 3, '2023-02-08', '15:00:00', '18:00:00', 1, 10, '농구', '5vs5', 1);
INSERT INTO team_match_result VALUES(15, 3, 8, '승'), (16, 4, 8, '패');
INSERT INTO `match` VALUES(9, 1, '2023-02-08', '15:00:00', '18:00:00', 1, 13, '농구', '5vs5', 1);
INSERT INTO team_match_result VALUES(17, 1, 9, '승'), (18, 3, 9, '패');
INSERT INTO `match` VALUES(10, 2, '2023-02-09', '15:00:00', '18:00:00', 3, 20, '축구', '5vs5', 1);
INSERT INTO team_match_result VALUES(19, 2, 10, '승'), (20, 5, 10, '패');
INSERT INTO `match` VALUES(11, 5, '2023-02-10', '15:00:00', '18:00:00', 3, 2, '축구', '5vs5', 1);
INSERT INTO team_match_result VALUES(21, 5, 11, '승'), (22, 2, 11, '패');
INSERT INTO `match` VALUES(12, 2, '2023-02-10', '15:00:00', '18:00:00', 3, 3, '축구', '5vs5', 1);
INSERT INTO team_match_result VALUES(23, 2, 12, '승'), (24, 5, 12, '패');
INSERT INTO `match` VALUES(13, 5, '2023-02-11', '15:00:00', '18:00:00', 3, 10, '축구', '5vs5', 1);
INSERT INTO team_match_result VALUES(25, 5, 13, '무'), (26, 2, 13, '무');
INSERT INTO `match` VALUES(14, 2, '2023-02-11', '15:00:00', '18:00:00', 1, 9, '축구', '5vs5', 1);
INSERT INTO team_match_result VALUES(27, 5, 14, '패'), (28, 2, 14, '승');
INSERT INTO `match` VALUES(15, 6, '2023-02-11', '15:00:00', '18:00:00', 1, 6, '배드민턴', '2vs2', 1);
INSERT INTO team_match_result VALUES(29, 6, 15, '승'), (30, 7, 15, '패');
INSERT INTO `match` VALUES(16, 7, '2023-02-12', '15:00:00', '18:00:00', 2, 5, '배드민턴', '2vs2', 1);
INSERT INTO team_match_result VALUES(31, 7, 16, '패'), (32, 6, 16, '승');
INSERT INTO `match` VALUES(17, 6, '2023-02-12', '15:00:00', '18:00:00', 2, 10, '배드민턴', '2vs2', 1);
INSERT INTO team_match_result VALUES(33, 6, 16, '패'), (34, 7, 16, '승');

INSERT INTO `match` VALUES(18, 1, '2023-02-17', '18:00:00', '19:00:00', 1, 10, '농구', '5vs5', 0);
INSERT INTO team_match_result VALUES(35, 1, 18, null);
INSERT INTO `match` VALUES(19, 3, '2023-02-17', '18:00:00', '20:00:00', 1, 5, '농구', '5vs5', 0);
INSERT INTO team_match_result VALUES(36, 3, 19, null);
INSERT INTO `match` VALUES(20, 3, '2023-02-17', '17:00:00', '19:00:00', 1, 6, '농구', '5vs5', 0);
INSERT INTO team_match_result VALUES(37, 4, 20, null);
INSERT INTO `match` VALUES(21, 4, '2023-02-17', '17:30:00', '21:00:00', 1, 7, '농구', '5vs5', 0);
INSERT INTO team_match_result VALUES(38, 4, 21, null);
INSERT INTO `match` VALUES(22, 1, '2023-02-17', '20:30:00', '21:00:00', 1, 8, '농구', '5vs5', 0);
INSERT INTO team_match_result VALUES(39, 1, 22, null);
INSERT INTO `match` VALUES(23, 2, '2023-02-17', '18:30:00', '21:00:00', 1, 8, '축구', '5vs5', 0);
INSERT INTO team_match_result VALUES(40, 2, 23, null);
INSERT INTO `match` VALUES(24, 5, '2023-02-17', '18:30:00', '21:00:00', 1, 2, '축구', '3vs3', 0);
INSERT INTO team_match_result VALUES(41, 5, 24, null);
INSERT INTO `match` VALUES(25, 6, '2023-02-17', '16:30:00', '21:00:00', 1, 13, '배드민턴', '2vs2', 0);
INSERT INTO team_match_result VALUES(42, 6, 25, null);
INSERT INTO `match` VALUES(26, 7, '2023-02-17', '16:30:00', '21:00:00', 1, 13, '배드민턴', '2vs2', 0);
INSERT INTO team_match_result VALUES(43, 7, 26, null);




        
