-- 덤프데이터
-- Member
INSERT INTO member_sometimes VALUES(111, '이경택', '이경택'), (222, '박진성', '박진성'), (333, '이강윤', '이강윤');
INSERT INTO member_often VALUES(111, '상태메시지1', '10:00~11:00', '웹토큰', '모바일토큰', 'taek.png'), (222, '상태메시지2', '10:00~11:00', '웹토큰', '모바일토큰', 'jinsung.png'), (333, '상태메시지1', '10:00~11:00', '웹토큰', '모바일토큰', 'gangyun.png');

-- Place
INSERT INTO place VALUES(1, '고운뜰공원', 36.3663369, 127.2961423), (2, '고운뜰공원', 36.3653369, 127.2971423), (3, '고운뜰공원', 36.3563369, 127.2991423);

-- Live
INSERT INTO live VALUES(1, 1, '안녕하세요', 3, 6, '19:00:00', 111, '농구'), (2, 2, '안녕하세요', 1, 6, '19:00:00', 222, '축구'), (3, 3, '안녕하세요', 5, 6, '19:00:00', 333, '배드민턴');
INSERT INTO live_member VALUES(1, 1, 111), (2, 2, 222), (3, 3, 333);

-- gathering
INSERT INTO gathering VALUES(1, 1, '3대3 농구하실분~', '같이 농구해요', 6, '2023년 2월 15일', '18:30', 2, 0, 111, '남성', '중수', '농구', '3대3'), (2, 1, '5대5 풋살 오세요~', '같이 풋살해요', 10, '2023년 2월 16일', '18:30', 2, 0, 222, '남성', '중수', '축구', '5대5'), (3, 1, '배드민턴 쳐요~', '같이 배드민턴 쳐요', 2, '2023년 2월 17일', '19:30', 1, 0, 333, '남성', '중수', '배드민턴', '1대1');
INSERT INTO gathering_member VALUES(1, 1, 111), (2, 2, 222), (3, 3, 333);